Revit 2027 API
TextNode.IsUnderlined Property
 Indicates whether the default formatting is set to underlined text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsUnderlined { get; }
Public ReadOnly Property IsUnderlined As Boolean
	Get
public:
property bool IsUnderlined {
	bool get ();
}
member IsUnderlined : bool with get
Property Value
Boolean
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace